{"keras_version": "2.1.2", "config": [{"config": {"name": "global_average_pooling2d_2", "batch_input_shape": [null, 7, 7, 2048], "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "bias_constraint": null, "units": 133, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}